### Pandas - Aggregate

In [1]:
import pandas as pd
import numpy as np

In [3]:
array = np.random.randint(10,30,size = (5,4))
df = pd.DataFrame(array, columns = list("ABCD"))
df

    A   B   C   D
0  26  26  16  15
1  25  17  17  10
2  28  24  24  24
3  14  19  18  28
4  10  10  29  25

In [4]:
df.describe()

               A          B          C          D
count   5.000000   5.000000   5.000000   5.000000
mean   20.600000  19.200000  20.800000  20.400000
std     8.049845   6.300794   5.540758   7.569676
min    10.000000  10.000000  16.000000  10.000000
25%    14.000000  17.000000  17.000000  15.000000
50%    25.000000  19.000000  18.000000  24.000000
75%    26.000000  24.000000  24.000000  25.000000
max    28.000000  26.000000  29.000000  28.000000

In [5]:
df["A"].mean()

20.6

In [7]:
df["A"].var()

64.8

In [8]:
df["A"].std()

8.049844718999243

In [10]:
df.aggregate(np.mean)

A    20.6
B    19.2
C    20.8
D    20.4
dtype: float64

In [12]:
df.mean()

A    20.6
B    19.2
C    20.8
D    20.4
dtype: float64

In [14]:
df.agg(np.mean)

A    20.6
B    19.2
C    20.8
D    20.4
dtype: float64

In [17]:
df.apply(np.mean)

A    20.6
B    19.2
C    20.8
D    20.4
dtype: float64

In [19]:
df.aggregate(np.max)

A    28
B    26
C    29
D    28
dtype: int32

In [21]:
df.aggregate([np.max])

       A   B   C   D
amax  28  26  29  28

In [23]:
df.aggregate([np.mean])

         A     B     C     D
mean  20.6  19.2  20.8  20.4

In [25]:
df.aggregate([np.mean, np.min])

         A     B     C     D
mean  20.6  19.2  20.8  20.4
amin  10.0  10.0  16.0  10.0

In [27]:
df.aggregate([np.mean, np.min, np.std])

              A          B          C          D
mean  20.600000  19.200000  20.800000  20.400000
amin  10.000000  10.000000  16.000000  10.000000
std    8.049845   6.300794   5.540758   7.569676

In [29]:
df.aggregate([np.mean, np.min, np.std, np.var])

              A          B          C          D
mean  20.600000  19.200000  20.800000  20.400000
amin  10.000000  10.000000  16.000000  10.000000
std    8.049845   6.300794   5.540758   7.569676
var   64.800000  39.700000  30.700000  57.300000

In [31]:
df.aggregate([np.mean, np.min, np.std, np.var, min, max])

              A          B          C          D
mean  20.600000  19.200000  20.800000  20.400000
amin  10.000000  10.000000  16.000000  10.000000
std    8.049845   6.300794   5.540758   7.569676
var   64.800000  39.700000  30.700000  57.300000
min   10.000000  10.000000  16.000000  10.000000
max   28.000000  26.000000  29.000000  28.000000

In [33]:
df.aggregate([np.mean, np.min, np.std, np.var, min, max, sum])

               A          B           C           D
mean   20.600000  19.200000   20.800000   20.400000
amin   10.000000  10.000000   16.000000   10.000000
std     8.049845   6.300794    5.540758    7.569676
var    64.800000  39.700000   30.700000   57.300000
min    10.000000  10.000000   16.000000   10.000000
max    28.000000  26.000000   29.000000   28.000000
sum   103.000000  96.000000  104.000000  102.000000

In [34]:
df.aggregate([np.mean, np.min, np.std, np.var, min, max, sum])

               A          B           C           D
mean   20.600000  19.200000   20.800000   20.400000
amin   10.000000  10.000000   16.000000   10.000000
std     8.049845   6.300794    5.540758    7.569676
var    64.800000  39.700000   30.700000   57.300000
min    10.000000  10.000000   16.000000   10.000000
max    28.000000  26.000000   29.000000   28.000000
sum   103.000000  96.000000  104.000000  102.000000

In [36]:
df.aggregate([min, max, sum])

       A   B    C    D
min   10  10   16   10
max   28  26   29   28
sum  103  96  104  102

In [42]:
df.aggregate([min, max, sum, 'std','var', 'median'])

                 A          B           C           D
min      10.000000  10.000000   16.000000   10.000000
max      28.000000  26.000000   29.000000   28.000000
sum     103.000000  96.000000  104.000000  102.000000
std       8.049845   6.300794    5.540758    7.569676
var      64.800000  39.700000   30.700000   57.300000
median   25.000000  19.000000   18.000000   24.000000

In [43]:
df.aggregate(['min', 'max', 'sum', 'std','var', 'median'])

                 A          B           C           D
min      10.000000  10.000000   16.000000   10.000000
max      28.000000  26.000000   29.000000   28.000000
sum     103.000000  96.000000  104.000000  102.000000
std       8.049845   6.300794    5.540758    7.569676
var      64.800000  39.700000   30.700000   57.300000
median   25.000000  19.000000   18.000000   24.000000

In [45]:
df['B'].aggregate(['min', 'max', 'sum', 'std','var', 'median'])

min       10.000000
max       26.000000
sum       96.000000
std        6.300794
var       39.700000
median    19.000000
Name: B, dtype: float64

In [46]:
df[['B','D']].aggregate(['min', 'max', 'sum', 'std','var', 'median'])

                B           D
min     10.000000   10.000000
max     26.000000   28.000000
sum     96.000000  102.000000
std      6.300794    7.569676
var     39.700000   57.300000
median  19.000000   24.000000

In [48]:
df

    A   B   C   D
0  26  26  16  15
1  25  17  17  10
2  28  24  24  24
3  14  19  18  28
4  10  10  29  25

In [50]:
df.iloc[1,2] = 'python'
df

    A   B       C   D
0  26  26      16  15
1  25  17  python  10
2  28  24      24  24
3  14  19      18  28
4  10  10      29  25

In [52]:
df.aggregate(['min', 'max', 'sum', 'std','var', 'median'])

<ipython-input-52-1cb9b129880b>:1: FutureWarning: ['C'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.aggregate(['min', 'max', 'sum', 'std','var', 'median'])

                 A          B           D
min      10.000000  10.000000   10.000000
max      28.000000  26.000000   28.000000
sum     103.000000  96.000000  102.000000
std       8.049845   6.300794    7.569676
var      64.800000  39.700000   57.300000
median   25.000000  19.000000   24.000000

In [55]:
df.select_dtypes(include=[int,float]).aggregate(['min', 'max', 'sum', 'std','var', 'median'])

                 A          B           D
min      10.000000  10.000000   10.000000
max      28.000000  26.000000   28.000000
sum     103.000000  96.000000  102.000000
std       8.049845   6.300794    7.569676
var      64.800000  39.700000   57.300000
median   25.000000  19.000000   24.000000